benchmarks/results/auth-serialization/test-me/optimization-01/wrk2-logs/run_2_2005_1015.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.933ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.010ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.83ms  819.81us   9.15ms   75.47%
    Req/Sec   314.22     50.18   545.00     82.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.88ms
 75.000%    5.22ms
 90.000%    5.66ms
 99.000%    7.36ms
 99.900%    8.20ms
 99.990%    8.98ms
 99.999%    9.16ms
100.000%    9.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.591     0.000000            1         1.00
       3.743     0.100000         1201         1.11
       4.211     0.200000         2414         1.25
       4.483     0.300000         3605         1.43
       4.699     0.400000         4816         1.67
       4.875     0.500000         6003         2.00
       4.951     0.550000         6608         2.22
       5.019     0.600000         7222         2.50
       5.079     0.650000         7800         2.86
       5.151     0.700000         8419         3.33
       5.223     0.750000         9013         4.00
       5.267     0.775000         9316         4.44
       5.315     0.800000         9605         5.00
       5.375     0.825000         9909         5.71
       5.435     0.850000        10202         6.67
       5.531     0.875000        10501         8.00
       5.591     0.887500        10660         8.89
       5.663     0.900000        10798        10.00
       5.799     0.912500        10951        11.43
       5.951     0.925000        11097        13.33
       6.159     0.937500        11248        16.00
       6.239     0.943750        11325        17.78
       6.323     0.950000        11400        20.00
       6.407     0.956250        11473        22.86
       6.507     0.962500        11549        26.67
       6.667     0.968750        11623        32.00
       6.739     0.971875        11660        35.56
       6.827     0.975000        11697        40.00
       6.911     0.978125        11734        45.71
       6.995     0.981250        11772        53.33
       7.075     0.984375        11810        64.00
       7.131     0.985938        11828        71.11
       7.219     0.987500        11847        80.00
       7.283     0.989062        11865        91.43
       7.423     0.990625        11885       106.67
       7.495     0.992188        11903       128.00
       7.599     0.992969        11913       142.22
       7.655     0.993750        11922       160.00
       7.723     0.994531        11932       182.86
       7.779     0.995313        11940       213.33
       7.835     0.996094        11950       256.00
       7.863     0.996484        11954       284.44
       7.927     0.996875        11959       320.00
       7.967     0.997266        11964       365.71
       8.003     0.997656        11968       426.67
       8.023     0.998047        11973       512.00
       8.047     0.998242        11975       568.89
       8.115     0.998437        11978       640.00
       8.155     0.998633        11980       731.43
       8.183     0.998828        11982       853.33
       8.223     0.999023        11986      1024.00
       8.223     0.999121        11986      1137.78
       8.263     0.999219        11987      1280.00
       8.399     0.999316        11988      1462.86
       8.415     0.999414        11989      1706.67
       8.623     0.999512        11992      2048.00
       8.623     0.999561        11992      2275.56
       8.623     0.999609        11992      2560.00
       8.623     0.999658        11992      2925.71
       8.799     0.999707        11993      3413.33
       8.815     0.999756        11994      4096.00
       8.815     0.999780        11994      4551.11
       8.815     0.999805        11994      5120.00
       8.815     0.999829        11994      5851.43
       8.983     0.999854        11995      6826.67
       8.983     0.999878        11995      8192.00
       8.983     0.999890        11995      9102.22
       8.983     0.999902        11995     10240.00
       8.983     0.999915        11995     11702.86
       9.159     0.999927        11996     13653.33
       9.159     1.000000        11996          inf
#[Mean    =        4.833, StdDeviation   =        0.820]
#[Max     =        9.152, Total count    =        11996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 6.71MB read
Requests/sec:    599.94
Transfer/sec:    229.08KB