benchmarks/results/auth-serialization/test-me/optimization-01/wrk2-logs/run_3_2005_1016.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 5.500ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.609ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.53ms    0.97ms   8.81ms   66.44%
    Req/Sec   313.45     51.64   500.00     83.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.53ms
 75.000%    5.14ms
 90.000%    5.86ms
 99.000%    6.97ms
 99.900%    7.76ms
 99.990%    8.15ms
 99.999%    8.81ms
100.000%    8.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.231     0.000000            1         1.00
       3.291     0.100000         1201         1.11
       3.631     0.200000         2399         1.25
       3.959     0.300000         3604         1.43
       4.295     0.400000         4807         1.67
       4.527     0.500000         6004         2.00
       4.635     0.550000         6609         2.22
       4.747     0.600000         7209         2.50
       4.859     0.650000         7800         2.86
       4.995     0.700000         8410         3.33
       5.139     0.750000         8997         4.00
       5.219     0.775000         9309         4.44
       5.315     0.800000         9604         5.00
       5.423     0.825000         9899         5.71
       5.555     0.850000        10198         6.67
       5.707     0.875000        10500         8.00
       5.783     0.887500        10647         8.89
       5.855     0.900000        10801        10.00
       5.923     0.912500        10946        11.43
       5.987     0.925000        11096        13.33
       6.059     0.937500        11249        16.00
       6.111     0.943750        11327        17.78
       6.167     0.950000        11399        20.00
       6.227     0.956250        11476        22.86
       6.299     0.962500        11549        26.67
       6.383     0.968750        11621        32.00
       6.471     0.971875        11659        35.56
       6.535     0.975000        11698        40.00
       6.611     0.978125        11734        45.71
       6.699     0.981250        11773        53.33
       6.775     0.984375        11809        64.00
       6.819     0.985938        11828        71.11
       6.875     0.987500        11846        80.00
       6.919     0.989062        11864        91.43
       6.995     0.990625        11884       106.67
       7.047     0.992188        11903       128.00
       7.127     0.992969        11911       142.22
       7.167     0.993750        11921       160.00
       7.235     0.994531        11931       182.86
       7.283     0.995313        11940       213.33
       7.331     0.996094        11949       256.00
       7.399     0.996484        11953       284.44
       7.479     0.996875        11958       320.00
       7.547     0.997266        11963       365.71
       7.571     0.997656        11967       426.67
       7.631     0.998047        11972       512.00
       7.639     0.998242        11974       568.89
       7.647     0.998437        11977       640.00
       7.671     0.998633        11979       731.43
       7.695     0.998828        11981       853.33
       7.767     0.999023        11984      1024.00
       7.831     0.999121        11985      1137.78
       7.843     0.999219        11986      1280.00
       7.875     0.999316        11987      1462.86
       7.903     0.999414        11988      1706.67
       7.931     0.999512        11990      2048.00
       7.931     0.999561        11990      2275.56
       8.019     0.999609        11991      2560.00
       8.019     0.999658        11991      2925.71
       8.035     0.999707        11992      3413.33
       8.095     0.999756        11993      4096.00
       8.095     0.999780        11993      4551.11
       8.095     0.999805        11993      5120.00
       8.095     0.999829        11993      5851.43
       8.155     0.999854        11994      6826.67
       8.155     0.999878        11994      8192.00
       8.155     0.999890        11994      9102.22
       8.155     0.999902        11994     10240.00
       8.155     0.999915        11994     11702.86
       8.815     0.999927        11995     13653.33
       8.815     1.000000        11995          inf
#[Mean    =        4.528, StdDeviation   =        0.973]
#[Max     =        8.808, Total count    =        11995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 6.71MB read
Requests/sec:    599.92
Transfer/sec:    229.07KB